      *================================================================*
       IDENTIFICATION                  DIVISION.
      *================================================================*
       PROGRAM-ID. @APPLID@TPPGM@PGMID.
       AUTHOR.     @AUTHOR.
      *================================================================*
      *                 @EMPRESA
      *----------------------------------------------------------------*
      *                                                                *
      *    APLICACAO       : @APPLID
      *                      @APPLNAME
      *    PROGRAMA        : @APPLID@TPPGM@PGMID
      *    PROGRAMADOR     : @AUTHOR
      *    ANALISTA        : @ANALISTA
      *    GRUPO           : @GRUPO
      *    DATA DE CRIACAO : @DATE
      *                                                                *
      *----------------------------------------------------------------*
      *    OBJETIVO....: @OBJETIVO
      *     SERVICO....: @SERVICO
      *                  @ENTIDADE0
      *                  @ENTIDADE1
      *                  @ENTIDADE2
      *----------------------------------------------------------------*
      *    BOOKS FUNCIONAIS...:                                        *
      *    @BOOKS_FUNCIONAIS
      *----------------------------------------------------------------*
      *    BOOKS DA ARQUITETURA:                                       *
      *    @BOOKS_ARQUITETURA:
      *----------------------------------------------------------------*
      *    MODULOS.............:                                       *
      *    @MODULOS
      *================================================================*

      *================================================================*
       ENVIRONMENT                     DIVISION.
      *================================================================*
      *----------------------------------------------------------------*
      *----------------------------------------------------------------*
       CONFIGURATION                   SECTION.
      *----------------------------------------------------------------*
       SPECIAL-NAMES.
           DECIMAL-POINT               IS COMMA.
      *----------------------------------------------------------------*
       INPUT-OUTPUT                    SECTION.
      *----------------------------------------------------------------*
       FILE-CONTROL.
      *----------------------------------------------------------------*
      @FILE_CONTROL
      *================================================================*
       DATA                            DIVISION.
      *----------------------------------------------------------------*
       FILE SECTION.
      *----------------------------------------------------------------*
      @FILE_SECTION
      *================================================================*
      *----------------------------------------------------------------*
       WORKING-STORAGE                 SECTION.
      *----------------------------------------------------------------*
       77  FILLER                      PIC  X(050)         VALUE
           '* INICIO DA WORKING-STORAGE *'.
      *----------------------------------------------------------------*
       77 WRK-PROGRAM                  PIC X(08) VALUE '@APPLID@TPPGM@PGMID'.
      *----------------------------------------------------------------*
