      *----------------------------------------------------------------*
      *  WORKING COMUM A TODOS OS MODULOS FUNCIONAIS E BASICOS         *
      *----------------------------------------------------------------*
       01  WRK-CONTROLES-AUXILIARES.
           03      WRK-MODULO               PIC  X(08) VALUE SPACES.
           03      WRK-LENGTH               PIC S9(05) COMP-3 VALUE +0.
           03      WRK-IDX                  PIC S9(09) COMP VALUE +0.
           03      WRK-ABCODE               PIC  X(04) VALUE SPACES.
           03      WRK-CURRENT-TIMESTAMP    PIC  X(26).
