           05 IMAG1200-HEADER.
              07 IMAG1200-COD-LAYOUT             PIC X(00008).
              07 IMAG1200-TAM-LAYOUT             PIC 9(00005).
           05 IMAG1200-REGISTRO.
              07                                 PIC X(32000).
