      *----------------------------------------------------------------*
       01  FILLER                      PIC  X(050)         VALUE
           '* AREA DE SAIDA *'.
      *----------------------------------------------------------------*
      *    WRK-@APPLIDW@SIGLAPGMS.
       01  FILLER.
           COPY @APPLIDW@SIGLAPGMS.
