      *----------------------------------------------------------------*
      *    DADOS DA SESSAO
      *----------------------------------------------------------------*
           MOVE FRWKWAAA-EMPRESA-OPER       TO @APPLIDW@SIGLAPGMI-EMPRESA-OPER.
           MOVE FRWKWAAA-DEPENDENCIA-OPER   TO @APPLIDW@SIGLAPGMI-DEPENDENCIA-OPER
           MOVE FRWKWAAA-CCANAL             TO @APPLIDW@SIGLAPGMI-CCANAL.
           MOVE FRWKWAAA-TIPO-USUAR         TO @APPLIDW@SIGLAPGMI-TIPO-USUAR.
           MOVE FRWKWAAA-CAUTEN-SEGRC       TO @APPLIDW@SIGLAPGMI-CAUTEN-SEGRC.
           MOVE FRWKWAAA-TIPO-USUAR-AUTORIZ TO
                                            @APPLIDW@SIGLAPGMI-TIPO-USUAR-AUTORIZ.
           MOVE FRWKWAAA-USUARIO-AUTORIZ    TO @APPLIDW@SIGLAPGMI-USUARIO-AUTORIZ.
           MOVE FRWKWAAA-NOPER-FLUXO        TO @APPLIDW@SIGLAPGMI-NOPER-FLUXO.
