      *----------------------------------------------------------------*
      *    DADOS DA SESSAO
      *----------------------------------------------------------------*
           MOVE @APPLIDW@SIGLAPGMI-EMPRESA-OPER       TO @APPLIDW@SIGLAPGMC-EMPRESA-OPER.
           MOVE @APPLIDW@SIGLAPGMI-DEPENDENCIA-OPER   TO @APPLIDW@SIGLAPGMC-DEPENDENCIA-OPER
           MOVE @APPLIDW@SIGLAPGMI-CCANAL             TO @APPLIDW@SIGLAPGMC-CCANAL.
           MOVE @APPLIDW@SIGLAPGMI-TIPO-USUAR         TO @APPLIDW@SIGLAPGMC-TIPO-USUAR.
           MOVE @APPLIDW@SIGLAPGMI-CAUTEN-SEGRC       TO @APPLIDW@SIGLAPGMC-CAUTEN-SEGRC.
           MOVE @APPLIDW@SIGLAPGMI-TIPO-USUAR-AUTORIZ TO
                                            @APPLIDW@SIGLAPGMC-TIPO-USUAR-AUTORIZ.
           MOVE @APPLIDW@SIGLAPGMI-USUARIO-AUTORIZ    TO @APPLIDW@SIGLAPGMC-USUARIO-AUTORIZ.
           MOVE @APPLIDW@SIGLAPGMI-NOPER-FLUXO        TO @APPLIDW@SIGLAPGMC-NOPER-FLUXO.
