
           EXEC CICS ASSIGN INVOKINGPROG (WRK-INVOKINGPROG)
                     NOHANDLE
           END-EXEC.

           IF EIBRESP NOT EQUAL DFHRESP(NORMAL)
              MOVE 16          TO @APPLIDW00C-COD-RETORNO  OF LNK-@APPLID3@SIGLAPGMI
              MOVE '0032'      TO @APPLIDW00C-COD-ERRO     OF LNK-@APPLID3@SIGLAPGMI
              MOVE '@ERROCICS'  TO @APPLIDW00C-COD-MENSAGEM OF LNK-@APPLID3@SIGLAPGMI
              SET ERRO-CICS           TO TRUE
              PERFORM 91000-API-ERROR
           END-IF.

           IF WRK-INVOKINGPROG(1:4) NOT EQUAL TO '@APPLID'
              MOVE 16          TO @APPLIDW00C-COD-RETORNO  OF LNK-@APPLID3@SIGLAPGMI
              MOVE '0033'      TO @APPLIDW00C-COD-ERRO     OF LNK-@APPLID3@SIGLAPGMI
              MOVE '@ERROLIV'  TO @APPLIDW00C-COD-MENSAGEM OF LNK-@APPLID3@SIGLAPGMI
              SET ERRO-LIVRE          TO TRUE
              PERFORM 91000-API-ERROR
           END-IF.
