      *----------------------------------------------------------------*
       @LABEL-MOVE-@DCLGEN-TO-@APPLIDW@SIGLAPGMC     SECTION.
      *----------------------------------------------------------------*
           MOVE '@LABEL-MOVE-@DCLGEN-TO-@APPLIDW@SIGLAPGMC' TO WRK-PARAGRAFO.

@VALORIZARBOOK

      *----------------------------------------------------------------*
       @LABEL-99-EXIT. EXIT.
      *----------------------------------------------------------------*

