@PKSDCLGEN
           EXEC SQL SELECT VALUE(MAX(@COLPK), 0) + 1
                      INTO :@DCLGEN.@COLCBL
                      FROM @OWNERDB2.@TABLENAME
@WHEREDCLGEN

           IF SQLCODE NOT EQUAL TO ZEROS
              MOVE 16          TO @APPLIDW00C-COD-RETORNO  OF LNK-@APPLID4@SIGLAPGM@PERSISTENCIA
              MOVE '@ERRLOCAL'      TO @APPLIDW00C-COD-ERRO     OF LNK-@APPLID4@SIGLAPGM@PERSISTENCIA
              MOVE '@ERRODB2'  TO @APPLIDW00C-COD-MENSAGEM OF LNK-@APPLID4@SIGLAPGM@PERSISTENCIA
              SET  ERRO-DB2    TO TRUE
              MOVE WRK-TABELA  TO FRWKGDB2-NOME-TABELA
              SET  DB2-SELECT  TO TRUE
              MOVE SPACES      TO FRWKGDB2-STORED-PROC
              MOVE SPACES      TO FRWKGDB2-LOCAL
              MOVE SQLCA       TO FRWKGDB2-SQLCA
              MOVE SQLCODE     TO FRWKGDB2-SQLCODE
              PERFORM 91000-API-ERROR
           END-IF.

@MOVETOBOOKS
