//*
//@STEP    EXEC @PROGRAMA
//*
//* ***    *************************************************************
//* ***    @COMENTARIO
//* ***    *************************************************************
//*
@ENTRADA
//*
@SAIDA
//*
//SYSOUT   DD SYSOUT=*
//SYSUDUMP DD SYSOUT=Y
